app/Controllers/Usuario_controller.php

    public function formValidationAdmin()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'nombre'   => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'telefono'  => 'required|min_length[8]',
            'pass'     => 'required|min_length[3]|max_length[10]',
            'perfil_id' => 'required|max_length[1]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            $data['titulo'] = 'Registro';
            echo view('front/header_view', $data);
            echo view('front/nav_view');
            echo view('admin/nuevoUsuario_view', ['validation' => $validation]);
            echo view('front/footer_view');
        } else {
            $formModel = new Usuarios_model();
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'email' => $this->request->getVar('email'),
                'telefono' => $this->request->getVar('telefono'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
                'perfil_id' => $this->request->getVar('perfil_id'),
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `telefono`, `pass`, `perfil_id`) VALUES ('Ivanaaaaa', 'Gimenez', 'iva@gime.com', '46869484', '$2y$10$UXo9P6X1CY9grU0qJKaX4uBBB4OCVIODwJda6zJ1NwB7TgzvN3pqC', '2')